Bushido3403/nodifyr-firmware/esp-test/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# NimBLE observer scanner + WiFi coexistence
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
# CENTRAL + GATT client required for ESP-IDF NimBLE to compile with scan-only apps
# (observer-only / no-GATT configs leave dead references in ble_gap.c / ble_gattc.c).
# Scanning still works; MAX_CONNECTIONS=0 keeps the device from accepting connections.
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=0
CONFIG_BT_NIMBLE_GATT_CLIENT=y
CONFIG_ESP_COEX_ENABLED=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# HTTPS for telemetry upload and provisioning claim
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Reliability: always self-recover, never halt on a fault
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Task watchdog: reboot if any core's idle task is starved (deadlock/livelock)
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

# Interrupt watchdog: catch ISRs / critical sections that run too long
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=800
